
#################
##  분석 종류  ##
#################

# 질적 자료 1개  표, 그래프(막대, 원)
# 양적 자료 1개  표, 그래프(히스토그램, 상자그림), 기술통계량
# 
# 가설검정
# 양적 자료 1개  일표본 검정
# - one sample t-test
# - Wicoxon's singned rank test
 

# 양적 자료 1개, 질적 자료 1개(값이 2가지인 경우- 성별남녀)
# 독립 2표본 검정
# - 독립 2표본 T검정(등분산, 이분산)
# - Wilcoxon's rank sum test = Mann - Whitney U test
 

# 양적 자료 1개, 양적 자료 1개(서로 쌍으로 이루어져야함) - 사전사후, xy차이
# 동일한 대상자에게 사전의 양적 자료, 사후의 양적 자료
# 동인한 대상자에게 x의 양적 자료, y의 양적 자료

# 대응 2표본 검정
# - 대응 2표본 T검정
# - Wicoxon's singned rank test

 
# 양적 자료 1개, 질적 자료 1개(값이 3가지 이상인 경우)
# - 분산 분석
# - Kruskal-Wallis rank sum test

 
# 양적 자료 1개, 양적 자료 1개(서로 쌍으로 이루어져야함)  관련성
# - 상관 분석

 
# 질적 자료 1개, 질적 자료 1개  관련성
# - 교차 분석 = 카이제곱검정 = Chi-Square test

 
# 양적 자료 1개(종속 변수), 양적 자료 1개(독립 변수)  
# 인과관계(원인결과)
# - 단순 선형 회귀 분석

 
# 양적 자료 1개(종속 변수), 양적질적 자료 1개 이상(독립 변수)  
# 인과관계 (원인결과) 
# - 다중 선형 회귀 분석

 
# 종속 변수  질적 자료 1개(값이 2가지인 경우)
# 독립 변수  양적 자료 1개 이상, 질적 자료 1개 이상
# - 이분형 로지스틱 회귀분석(sigmoid function)

 
# 종속 변수  질적 자료 1개(값이 3가지인 경우)
# 독립 변수  양적 자료 1개 이상, 질적 자료 1개 이상
# - 다분형 로지스틱 회귀분석(softmax function)# 